{
  "header": {
    "beta": "VERSION BÊTA : Cet outil est en cours d'élaboration. Vos <a href=\"mailto:statcan.sdg-odd.statcan@statcan.gc.ca\" class=\"text-white underline hover:text-white/80 hover:underline\">commentaires</a> sont les bienvenus.",
    "title": "Outil d'évaluation de l'adéquation des données",
    "switchToFrench": "Français",
    "switchToEnglish": "English",
    "returnToHome": "Retourner à la page d'accueil"
  },
  "footer": {
    "copyright": "© Statistique Canada - Outil d'évaluation de l'adéquation des données.",
    "builtWith": "Développé avec <a href=\"https://fr.react.dev/\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"text-blue-600 hover:text-blue-800 hover:underline\">React</a>"
  },
  "frontPage": {
    "titleLine1": "Bienvenue à ",
    "titleLine2": "l'outil d'évaluation de l'adéquation des données",
    "intro": "L'outil d'évaluation de l'adéquation des données est principalement conçu pour aider à évaluer si les données non officielles sont considérées comme adéquates à l'utilisation pour contribuer aux rapports du Canada sur les objectifs de développement durable (ODD), mais il peut aussi être utilisé pour évaluer des données à toute autre fin.",
    "assessmentInfo": "Avec cet outil, l'adéquation des données est évaluée en fonction de la qualité et de l'éthique des données.",
    "bulletPoints": {
      "item1": "L'éthique des données permet d'évaluer si les données ont été acquises et utilisées de manière appropriée tout au long de leur cycle de vie, qui s'étend de l'acquisition à la diffusion.",
      "item2": "La qualité des données est importante puisqu'elle permet d'évaluer les mesures mises en place pour protéger les données contre les erreurs et informer les utilisateurs de leur adéquation à l'utilisation.",
      "label": "Liste des critères d'évaluation"
    },
    "usage": "Si vous souhaitez poursuivre l'évaluation de vos données pour un rapport potentiel sur les ODD, veuillez <a href=\"mailto:statcan.sdg-odd.statcan@statcan.gc.ca\" class=\"text-white underline hover:text-white/80\" aria-label=\"Nous envoyer un courriel concernant votre évaluation de données\">nous contacter</a> avec votre soumission une fois que les données ont été évaluées avec succès à l'aide de cet outil.",
    "noteToUsers": "Veuillez noter que cet outil d'évaluation de l'adéquation des données n'est pas destiné à évaluer si les données répondent aux normes de statistiques officielles.",
    "contactInfo": "N'hésitez pas à <a href=\"mailto:statcan.sdg-odd.statcan@statcan.gc.ca\" class=\"text-white underline hover:text-white/80 hover:underline\" aria-label=\"Envoyer un courriel à l'équipe ODD de Statistique Canada pour des questions\">contacter l'équipe ODD de Statistique Canada</a> si vous avez des questions.",
    "email": "statcan.sdg-odd.statcan@statcan.gc.ca",
    "startButton": "Commencer l'évaluation",
    "startButtonAriaLabel": "Commencer l'évaluation de l'adéquation des données",
    "emailAriaLabel": "Envoyer un courriel à l'équipe ODD de Statistique Canada"
  },
  "mainContent": {
    "tabs": {
      "assessment": "Outil d'évaluation de l'adéquation des données",
      "license": "Licence"
    },
    "navigation": "Onglets de navigation principaux"
  },
  "license": {
    "title": "Informations de licence",
    "intro": "Cette page contient des informations sur les conditions d'utilisation et la licence pour l'outil d'évaluation de l'adéquation des données.",
    "table": {
      "headers": {
        "section": "Section",
        "details": "Détails"
      },
      "termsSection": "Conditions d'utilisation",
      "termsDetails": {
        "part1": "Sauf indication contraire, le code source du programme inclus dans ce logiciel est couvert par le droit d'auteur de la Couronne, Gouvernement du Canada, et est distribué sous la licence MIT.",
        "part2": "Le mot-symbole Canada et les graphiques associés à cette distribution sont protégés par le droit des marques et le droit d'auteur. Aucune autorisation n'est accordée pour les utiliser en dehors des paramètres du programme d'identité visuelle du gouvernement du Canada. Pour plus d'informations, consultez <a href=\"https://www.canada.ca/fr/secretariat-conseil-tresor/services/communications-gouvernementales/programme-federal-image-marque.html\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"text-blue-600 hover:text-blue-800 hover:underline\">http://www.tbs-sct.gc.ca/fip-pcim/index-fra.asp</a>.",
        "part3": "Le titre de droit d'auteur de tous les logiciels tiers distribués avec ce logiciel est détenu par les détenteurs de droits d'auteur respectifs, comme indiqué dans ces fichiers. Les utilisateurs sont invités à lire les licences tierces référencées avec ces actifs."
      },
      "privacySection": "Confidentialité et stockage des données",
      "privacyDetails": "Cet outil d'évaluation de l'adéquation des données effectue toutes les évaluations localement dans le navigateur de l'utilisateur ou de l'utilisatrice. Aucune donnée n'est collectée, stockée ou transmise à Statistique Canada.",
      "licenseSection": "Licence MIT",
      "licenseDetails": {
        "copyright": "Copyright © {{year}} Gouvernement du Canada - Government of Canada",
        "part1": "La permission est accordée, sans frais, à toute personne obtenant une copie de ce logiciel et des fichiers de documentation associés (le \"Logiciel\"), de traiter le Logiciel sans restriction, y compris, sans limitation, les droits d'utilisation, de copie, de modification, de fusion, de publication, de distribution, de sous-licence et/ou de vente de copies du Logiciel, et de permettre aux personnes à qui le Logiciel est fourni de le faire, sous réserve des conditions suivantes :",
        "part2": "L'avis de droit d'auteur ci-dessus et cet avis de permission doivent être inclus dans toutes les copies ou parties substantielles du Logiciel.",
        "part3": "LE LOGICIEL EST FOURNI \"TEL QUEL\", SANS GARANTIE D'AUCUNE SORTE, EXPRESSE OU IMPLICITE, Y COMPRIS, MAIS SANS S'Y LIMITER, LES GARANTIES DE QUALITÉ MARCHANDE, D'ADÉQUATION À UN USAGE PARTICULIER ET DE NON-VIOLATION. EN AUCUN CAS, LES AUTEURS OU LES TITULAIRES DU DROIT D'AUTEUR NE SERONT RESPONSABLES DE TOUTE RÉCLAMATION, DOMMAGE OU AUTRE RESPONSABILITÉ, QUE CE SOIT DANS UNE ACTION CONTRACTUELLE, DÉLICTUELLE OU AUTRE, DÉCOULANT DE, OU EN RELATION AVEC LE LOGICIEL OU L'UTILISATION OU D'AUTRES TRANSACTIONS DANS LE LOGICIEL."
      }
    }
  },
  "assessment": {
    "ethics": {
      "title": "Partie 1 - Principes de l'éthique des données",
      "intro": {
        "intro": "Les principes fondamentaux de l'éthique des données de Statistique Canada pour la collecte, l'édition et la diffusion des données sont évalués à travers les cinq éléments suivants : ",
        "bulletPoints": {
          "item1": "Avantages pour la population canadienne,",
          "item2": "Équité et absence de préjudice,",
          "item3": "Transparence et responsabilisation,",
          "item4": "Protection de la vie privée, et",
          "item5": "Confidentialité."
        },
        "part1": "L'évaluation de chacun de ces éléments nous aide à évaluer si les données sont utilisées de manière appropriée tout au long de leur cycle de vie et peuvent donc être considérées comme adéquates pour contribuer aux rapports sur les objectifs de développement durable (ODD). Veuillez consulter le <a href=\"https://www.statcan.gc.ca/en/trust\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"text-blue-600 hover:text-blue-800 hover:underline\">Centre de confiance de Statistique Canada</a> pour en savoir plus sur l'éthique des données.",
        "part2": "Chaque principe d'éthique est évalué ci-dessous en répondant si les données sont alignées avec les principes ou non."
      },
      "table": {
        "caption": "Évaluation des principes d'éthique des données",
        "headers": {
          "elements": "Éléments",
          "explanation": "Explications",
          "criteria": "Critères",
          "answer": "Réponses"
        },
        "answers": {
          "select": "Sélectionner",
          "yes": "Oui",
          "no": "Non"
        }
      },
      "results": {
        "title": "Résultats de l'évaluation par rapport aux principes fondamentaux de l'éthique des données de Statistique Canada :",
        "pass": "Réussite",
        "fail": "Échec",
        "passMessage": "Telles qu'évaluées ci-dessus, les données sont considérées comme adéquates à l'utilisation pour les rapports sur les ODD.",
        "failMessage": "Telles qu'évaluées ci-dessus, les données ne sont pas considérées comme adéquates à l'utilisation pour les rapports sur les ODD. Pour en savoir plus et améliorer l'éthique et la qualité des données, veuillez consulter la page d'information de Statistique Canada."
      },
      "actions": {
        "continue": "Continuer",
        "evaluate": "Évaluer"
      },
      "alerts": {
        "answerAll": "Veuillez fournir des réponses pour tous les critères."
      }
    },
    "quality": {
      "title": "Partie 2 - Dimensions de la qualité des données",
      "intro": {
        "intro": "Les dimensions de qualité des données suivantes de Statistique Canada sont utilisées pour évaluer la qualité des données :",
        "bulletPoints": {
          "item1": "Exactitude et fiabilité,",
          "item2": "Actualité et ponctualité,",
          "item3": "Accessibilité et clarté,",
          "item4": "Intelligibilité,",
          "item5": "Cohérence et comparabilité."
        },
        "part1": "L'évaluation de chacune de ces dimensions aide à évaluer ce qui a été fait aux données durant l'acquisition et le traitement, ainsi que la façon dont les données sont rendues disponibles. Cette évaluation fournit une évaluation des méthodes en place pour protéger contre les erreurs et informer et donner confiance dans la qualité des données aux utilisateurs.",
        "part2": "Chaque dimension de qualité est évaluée ci-dessous en évaluant si les données satisfont le critère, et en sélectionnant la case à cocher pour chaque critères/critère satisfait."
      },
      "table": {
        "caption": "Évaluation des dimensions de la qualité",
        "headers": {
          "elements": "Éléments",
          "definition": "Définitions",
          "criteria": "Critères",
          "answer": "Réponses"
        },
        "tooltip": {
          "title": "Les points correspondent au nombre de critères respectés :",
          "high": "3 points = Élevé (tous les critères respectés)",
          "medium": "2 points = Moyen (2 critères respectés)",
          "low": "1 point = Faible (1 critère respecté)",
          "notSufficient": "0 point = Insuffisant (aucun critère respecté)",
          "exceptions": "Veuillez noter que la dimension 'Accessibilité et clarté' ne contient que 2 critères ; satisfaire les deux critères (2/2) résulte en la note maximale de 3 points (Élevée)."
        },
        "options": {
          "notSufficient": "0 - Insuffisant (aucun critère respecté)",
          "low": "1 - Faible (1 critère respecté)",
          "medium": "2 - Moyen (2 critères respectés)",
          "high": "3 - Élevé (tous les critères respectés)"
        }
      },
      "summary": {
          "title": "Résultats de l'évaluation par rapport aux dimensions de la qualité des données de Statistique Canada :",
          "tableCaption": "Résultats détaillés des dimensions de la qualité des données",
        "tableHeaders": {
          "dimension": "Dimensions",
          "score": "Résultats",
          "assessment": "Évaluation"
        },
        "totalScore": "Résultat total :",
        "scoreDisplay": "{{score}}/{{maxScore}}",
        "pass": "Réussite",
        "fail": "Échec"
      },
      "scoreText": {
        "notSufficient": "Insuffisant",
        "low": "Faible",
        "medium": "Moyen",
        "high": "Élevé"
      },
      "interpretation": {
        "low": "Telle qu'évaluée ci-dessus, la qualité des données n'est pas considérée comme adéquate à l'utilisation pour les rapports sur les ODD. Pour en savoir plus et améliorer l'éthique et la qualité des données, veuillez consulter la page d'information de Statistique Canada.",
        "medium": "Telle qu'évaluée ci-dessus, la qualité des données est considérée comme adéquate à l'utilisation pour les rapports sur les ODD mais pourrait être améliorée. Pour en savoir plus et améliorer l'éthique et la qualité des données, veuillez consulter la page d'information de Statistique Canada.",
        "high": "Telle qu'évaluée ci-dessus, la qualité des données est considérée comme adéquate à l'utilisation pour les rapports sur les ODD.",
        "fail": "Telle qu'évaluée ci-dessus, la qualité des données n'est pas considérée comme adéquate à l'utilisation pour les rapports sur les ODD. Pour en savoir plus et améliorer l'éthique et la qualité des données, veuillez consulter la page d'information de Statistique Canada."
      },
      "actions": {
        "evaluate": "Évaluer",
        "continue": "Continuer",
        "goBack": "Retour"
      }
    },
    "overall": {
      "title": "Évaluation globale",
      "summary": {
        "title": "Résumé",
        "ethicsResults": "Partie 1 - Évaluation des principes d'éthique des données :",
        "qualityResults": "Partie 2 - Évaluation des dimensions de qualité :",
        "overallResults": "Résultat global de l'évaluation :",
        "pass": "Réussite",
        "fail": "Échec",
        "warning": "Avertissement",
        "score": "Résultat : {{score}}/15",
        "totalScore": "Résultat total sur 15"
      },
      "messages": {
        "bothPass": "Telles qu'évaluées, les données sont considérées comme adéquates à l'utilisation pour les rapports sur les ODD.",
        "ethicsFailQualityPass": "Telles qu'évaluées, les données ne sont pas considérées comme adéquates à l'utilisation pour les rapports sur les ODD. Les données doivent satisfaire tous les principes fondamentaux d'éthique des données pour être considérées comme adéquates à l'utilisation pour les rapports sur les ODD. Pour en savoir plus et améliorer l'éthique et la qualité des données, veuillez consulter la page d'information de Statistique Canada.",
        "ethicsPassQualityFail": "Telles qu'évaluées, les données ne sont pas considérées comme adéquates à l'utilisation pour les rapports sur les ODD. Les données doivent obtenir un score minimum de 8 sur l'évaluation par rapport aux critères des dimensions de qualité. Pour en savoir plus et améliorer l'éthique et la qualité des données, veuillez consulter la page d'information de Statistique Canada.",
        "bothFail": "Telles qu'évaluées, les données ne sont pas considérées comme adéquates à l'utilisation pour les rapports sur les ODD. Pour en savoir plus et améliorer l'éthique et la qualité des données, veuillez consulter la page d'information de Statistique Canada."
      },
      "qualitySummary": {
        "title": "Résumé des dimensions de la qualité des données",
        "tableHeaders": {
          "dimension": "Dimensions",
          "score": "Résultat",
          "assessment": "Évaluation"
        }
      },
      "export": {
        "title": "Exporter l'évaluation",
        "formatLabel": "Format d'exportation :",
        "formats": {
          "text": "Texte",
          "csv": "CSV",
          "pdf": "PDF",
          "word": "Document Word"
        },
        "buttons": {
          "export": "Exporter les résultats",
          "copy": "Copier dans le presse-papiers",
          "download": "Télécharger",
          "close": "Fermer"
        },
        "generating": "Génération en cours...",
        "dialogTitle": "Exporter les résultats d'évaluation",
        "summaryHeader": "SOMMAIRE",
        "date": "Date",
        "ethicsAssessment": "Évaluation d'éthique des données",
        "message": "Détails de l'évaluation des principes d'éthique des données",
        "qualityAssessment": "Évaluation des dimensions de la qualité",
        "interpretation": "Détails de l'évaluation des dimensions de la qualité",
        "score": "Résultat des dimensions de la qualité",
        "result": "Résultat global",
        "category": "Catégorie",
        "ethicsPrinciples": "PRINCIPES D'ÉTHIQUE DES DONNÉES",
        "ethicsPrinciple": "Principe d'éthique des données",
        "ethicsPrinciplesList": "Principes d'éthique des données",
        "evaluation": "Évaluation",
        "qualityDimensions": "DIMENSIONS DE LA QUALITÉ",
        "qualityDimension": "Dimension de la qualité",
        "qualityDimensionsList": "Dimensions de la qualité",
        "scoreHeader": "Résultat",
        "assessment": "Évaluation",
        "notEvaluated": "Non évalué",
        "criteriaStatus": {
          "satisfied": "RESPECTÉ",
          "notSatisfied": "NON RESPECTÉ"
        },
        "overallResult": "Résultat global",
        "overallMessage": "Détails de l'évaluation globale",
        "criteriaDetails": "Détails des critères",
        "preview": "Aperçu",
        "pdfPreview": "Un rapport PDF sera généré lorsque vous cliquez sur Télécharger.",
        "wordPreview": "Un rapport Word sera généré lorsque vous cliquez sur Télécharger."
      },
      "criteriaSatisfied": "Critères respectés ou non respectés",
      "actions": {
        "reset": "Réinitialiser l'évaluation",
        "home": "Retourner à l'accueil"
      }
    }
  },
  "ethicsPrinciples": {
    "principle1": {
      "element": "Avantages pour la population canadienne",
      "explanation": "Les renseignements obtenus et utilisés doivent fournir à la population canadienne un avantage clair et facile à communiquer. Les données doivent appuyer les rapports du Canada sur les objectifs de développement durable (ODD) en permettant la mesure d'un indicateur non présenté ou en fournissant des données plus granulaires pour un indicateur déjà présenté.",
      "criteria": "Les renseignements fournissent-ils un avantage clair à la population canadienne?"
    },
    "principle2": {
      "element": "Équité et absence de préjudice",
      "explanation": "Les données qui incluent des sujets potentiellement sensibles nécessitent un plan de diffusion pour atténuer tout préjudice potentiel, toute injustice ou tout risque d'amplification des stéréotypes et de la stigmatisation des groupes présentés dans les données. De plus, les partenaires appropriés doivent être consultés tout au long du processus pour discuter de tout problème potentiel d'équité et de préjudice. Les données doivent utiliser la terminologie et les catégories appropriées pour décrire les différents groupes de population présentés.",
      "criteria": "Les sujets potentiellement sensibles sont-ils traités de manière à assurer l'équité et à ne causer aucun préjudice?"
    },
    "principle3": {
      "element": "Transparence et responsabilisation",
      "explanation": "Les méthodes utilisées pour transformer les renseignements afin de produire des statistiques doivent être communiquées clairement pour assurer la transparence. La méthodologie utilisée doit être documentée et continuellement surveillée avec ses résultats pour assurer une robustesse et une pertinence continues pour les rapports.",
      "criteria": "Les méthodes utilisées sont-elles comprises, surveillées et communiquées régulièrement avec leurs résultats?"
    },
    "principle4": {
      "element": "Protection de la vie privée",
      "explanation": "Protéger la vie privée des répondants tout au long du processus statistique est crucial. La vie privée se réfère au droit du répondant de décider comment ses données personnelles sont collectées et utilisées. La vie privée des répondants doit être maintenue pendant toutes les étapes du processus statistique.",
      "criteria": "La vie privée des répondants est-elle respectée?"
    },
    "principle5": {
      "element": "Confidentialité",
      "explanation": "S'assurer que les données ne contiennent pas d'informations confidentielles, telles que des informations personnelles ou des caractéristiques d'identification, est crucial pour assurer la confidentialité. Quelques exemples de méthodes qui peuvent aider incluent limiter l'accès aux informations confidentielles selon le principe du « besoin de savoir » tout en limitant la collecte aux informations strictement nécessaires de personnes pleinement consentantes.",
      "criteria": "La confidentialité est-elle maintenue?"
    }
  },
  "qualityDimensions": {
    "dimension1": {
      "element": "Exactitude et fiabilité",
      "definition": "L'exactitude des renseignements statistiques désigne la mesure dans laquelle les renseignements décrivent correctement le phénomène qu'ils sont censés mesurer. La fiabilité correspond à la mesure dans laquelle les renseignements statistiques décrivent correctement, et de façon constante au fil du temps, le phénomène qu'ils sont censés mesurer. Les données doivent mesurer, avec exactitude et fiabilité, les progrès accomplis par le Canada à l'égard d'un indicateur choisi des ODD.",
      "criteria": [
        "Il n'y a pas ou peu de valeurs manquantes.",
        "Des règles de vérification sont établies pour la validation des données.",
        "Des processus d'assurance qualité documentés ont été suivis."
      ]
    },
    "dimension2": {
      "element": "Actualité et ponctualité",
      "definition": "L'actualité des renseignements statistiques se réfère au délai entre la période de référence de l'information et la date à laquelle l'information devient disponible. La ponctualité se réfère à la différence entre la disponibilité planifiée et réelle. Les données doivent fournir une mesure des progrès du Canada sur les ODD à des intervalles planifiés et réguliers dans le temps couvrant la période de l'Agenda 2030.",
      "criteria": [
        "Les données sont disponibles en temps opportun.",
        "Les données sont diffusées à des intervalles réguliers.",
        "Les données sont publiées aux dates prévues."
      ]
    },
    "dimension3": {
      "element": "Accessibilité et clarté",
      "definition": "L'accessibilité et la clarté des données et des informations de soutien se réfèrent à la facilité avec laquelle les utilisateurs peuvent apprendre que l'information existe, la trouver, la visualiser et l'utiliser. Les données et leurs informations de soutien doivent être facilement accessibles et récoltables pour faciliter leur utilisation dans les rapports du Canada sur les ODD.",
      "criteria": [
        "Les données et les renseignements à l'appui sont facilement accessibles.",
        "Les données et les renseignements à l'appui sont fournis dans un format convivial."
      ]
    },
    "dimension4": {
      "element": "Intelligibilité",
      "definition": "L'intelligibilité des renseignements statistiques se réfère à la disponibilité des informations d'accompagnement nécessaires pour interpréter les données et possiblement les reproduire. Ces informations couvrent normalement les concepts sous-jacents, la période de référence des données, les variables, les classifications utilisées ainsi que la méthodologie de collecte et de traitement des données.",
      "criteria": [
        "Les utilisateurs et les utilisatrices ont accès à une description des méthodes utilisées pour recueillir, traiter et analyser les données.",
        "Les utilisateurs et les utilisatrices ont accès aux définitions de l'ensemble des variables, des ensembles de codes et des classifications utilisés.",
        "La période de référence des données est bien définie et communiquée."
      ]
    },
    "dimension5": {
      "element": "Cohérence et comparabilité",
      "definition": "La cohérence et la comparabilité des renseignements statistiques se réfèrent à la mesure dans laquelle ils peuvent être combinés et comparés de manière fiable avec d'autres renseignements statistiques et dans le temps. L'utilisation de concepts communs (par ex. terminologie, classification, méthodologie, etc.) sont cruciaux pour assurer la cohérence et faciliter leur utilisation dans les rapports du Canada sur les ODD.",
      "criteria": [
        "Des concepts normalisés sont utilisés.",
        "La comparabilité est maintenue au fil du temps et d'une région à l'autre.",
        "Toute incohérence ou rupture dans la série chronologique est expliquée."
      ]
    }
  },
  "alerts": {
    "title": "Alerte",
    "ok": "OK"
  }
} 
