{
  "header": {
    "beta": "VERSION BÊTA : Cet outil est en cours de développement. Nous apprécions vos commentaires.",
    "title": "Outil d'auto-évaluation de la qualité des données",
    "switchToFrench": "Français",
    "switchToEnglish": "English"
  },
  "footer": {
    "copyright": "© Statistique Canada - Outil d'auto-évaluation de la qualité des données.",
    "builtWith": "Développé avec <a href=\"https://fr.react.dev/\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"text-blue-600 hover:text-blue-800 hover:underline\">React</a>, <a href=\"https://www.typescriptlang.org/\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"text-blue-600 hover:text-blue-800 hover:underline\">TypeScript</a>, <a href=\"https://www.radix-ui.com/\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"text-blue-600 hover:text-blue-800 hover:underline\">Radix UI</a> et <a href=\"https://tailwindcss.com/\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"text-blue-600 hover:text-blue-800 hover:underline\">Tailwind CSS</a>"
  },
  "frontPage": {
    "titleLine1": "Bienvenue à l'outil",
    "titleLine2": "d'auto-évaluation de la qualité des données",
    "intro": "L'outil d'auto-évaluation de la qualité des données est conçu pour évaluer l'adéquation des données non officielles pour les rapports sur les ODD. Cet outil est basé sur les principes d'éthique des données et le cadre des dimensions de qualité établis par Statistique Canada.",
    "assessmentInfo": "En utilisant cet outil, vous pourrez évaluer vos données par rapport à :",
    "bulletPoints": {
      "item1": "Les principes fondamentaux de l'éthique des données de Statistique Canada pour la collecte, l'édition et la diffusion des données",
      "item2": "Cinq des six dimensions de qualité développées et utilisées par Statistique Canada pour assurer la qualité des données"
    },
    "usage": "Toute personne qui souhaite évaluer des données pour potentialité de rapports sur les ODD devrait utiliser cet outil pour évaluer la qualité et les normes éthiques de ses données avant de les soumettre.",
    "noteToUsers": "Veuillez noter que cet outil d'auto-évaluation de la qualité des données n'est pas suffisant pour évaluer si les données répondent aux normes officielles de la statistique.",
    "contactInfo": "Si vous souhaitez soumettre vos données ou contacter un analyste après avoir terminé votre évaluation, veuillez contacter l'équipe ODD de Statistique Canada à :",
    "email": "statcan.sdg-odd.statcan@statcan.gc.ca",
    "startButton": "Commencer l'évaluation"
  },
  "mainContent": {
    "tabs": {
      "assessment": "Outil d'auto-évaluation de la qualité des données",
      "license": "Licence"
    }
  },
  "license": {
    "title": "Informations de licence",
    "intro": "Cette page contient des informations sur les conditions d'utilisation, la confidentialité et le stockage des données, et la licence pour l'outil d'auto-évaluation de la qualité des données.",
    "table": {
      "headers": {
        "section": "Section",
        "details": "Détails"
      },
      "termsSection": "Conditions d'utilisation",
      "termsDetails": {
        "part1": "Sauf indication contraire, le code source du programme inclus dans ce logiciel est couvert par le droit d'auteur de la Couronne, Gouvernement du Canada, et est distribué sous la licence MIT.",
        "part2": "Le mot-symbole Canada et les graphiques associés à cette distribution sont protégés par le droit des marques et le droit d'auteur. Aucune autorisation n'est accordée pour les utiliser en dehors des paramètres du programme d'identité visuelle du gouvernement du Canada.",
        "part3": "Le titre de droit d'auteur de tous les logiciels tiers distribués avec ce logiciel est détenu par les détenteurs de droits d'auteur respectifs, comme indiqué dans ces fichiers. Les utilisateurs sont invités à lire les licences tierces référencées avec ces actifs."
      },
      "privacySection": "Confidentialité et stockage des données",
      "privacyDetails": "Cet outil ne stocke, ne collecte ni ne transmet aucune donnée d'entrée utilisateur ou d'évaluation. Toutes les évaluations sont effectuées localement dans votre navigateur et aucune information n'est envoyée à des serveurs externes ou stockée par Statistique Canada.",
      "licenseSection": "Licence MIT",
      "licenseDetails": {
        "copyright": "Copyright © {{year}} Gouvernement du Canada - Government of Canada",
        "part1": "La permission est accordée, sans frais, à toute personne obtenant une copie de ce logiciel et des fichiers de documentation associés (le \"Logiciel\"), de traiter le Logiciel sans restriction, y compris, sans limitation, les droits d'utilisation, de copie, de modification, de fusion, de publication, de distribution, de sous-licence et/ou de vente de copies du Logiciel, et de permettre aux personnes à qui le Logiciel est fourni de le faire, sous réserve des conditions suivantes :",
        "part2": "L'avis de droit d'auteur ci-dessus et cet avis de permission doivent être inclus dans toutes les copies ou parties substantielles du Logiciel.",
        "part3": "LE LOGICIEL EST FOURNI \"TEL QUEL\", SANS GARANTIE D'AUCUNE SORTE, EXPRESSE OU IMPLICITE, Y COMPRIS, MAIS SANS S'Y LIMITER, LES GARANTIES DE QUALITÉ MARCHANDE, D'ADÉQUATION À UN USAGE PARTICULIER ET DE NON-VIOLATION. EN AUCUN CAS, LES AUTEURS OU LES TITULAIRES DU DROIT D'AUTEUR NE SERONT RESPONSABLES DE TOUTE RÉCLAMATION, DOMMAGE OU AUTRE RESPONSABILITÉ, QUE CE SOIT DANS UNE ACTION CONTRACTUELLE, DÉLICTUELLE OU AUTRE, DÉCOULANT DE, OU EN RELATION AVEC LE LOGICIEL OU L'UTILISATION OU D'AUTRES TRANSACTIONS DANS LE LOGICIEL."
      }
    }
  },
  "assessment": {
    "ethics": {
      "title": "Partie 1 - Principes d'éthique des données",
      "intro": {
        "part1": "La première partie consiste en une évaluation des données par rapport aux principes fondamentaux de Statistique Canada en matière de collecte, de vérification et de diffusion des données.",
        "part2": "Veuillez évaluer chaque élément pour vérifier si les données s'harmonisent avec les principes ou non."
      },
      "table": {
        "caption": "Évaluation des principes d'éthique des données",
        "headers": {
          "elements": "Éléments",
          "explanation": "Explication",
          "criteria": "Critères",
          "answer": "Réponse"
        },
        "answers": {
          "select": "Sélectionner",
          "yes": "Oui",
          "no": "Non"
        }
      },
      "results": {
        "title": "Résultats de l'évaluation par rapport aux principes fondamentaux de Statistique Canada :",
        "pass": "Réussite",
        "fail": "Échec",
        "passMessage": "Telles qu'évaluées ci-dessus par rapport aux principes fondamentaux de Statistique Canada, les données sont considérées comme apte à l'emploi pour les rapports sur les ODD.",
        "failMessage": "Telles qu'évaluées ci-dessus par rapport aux principes fondamentaux de Statistique Canada, les données ne sont pas considérées comme apte à l'emploi pour les rapports sur les ODD. Veuillez réviser vos données pour s'assurer que tous les principes fondamentaux sont respectés pour être considérées comme apte à l'emploi pour les rapports sur les ODD."
      },
      "actions": {
        "continue": "Continuer",
        "evaluate": "Évaluer"
      },
      "alerts": {
        "answerAll": "Veuillez fournir des réponses pour tous les principes fondamentaux."
      }
    },
    "quality": {
      "title": "Partie 2 - Dimensions de la qualité",
      "intro": {
        "part1": "La deuxième partie de l'évaluation repose sur cinq des six dimensions de la qualité élaborées et utilisées par Statistique Canada. La dimension qui permet d'évaluer la pertinence n'est pas incluse ci-dessous, car il s'agit d'un élément évalué en fonction de l'avantage pour la population canadienne par rapport aux principes fondamentaux ci-dessus. Une définition et une série de critères sont fournies pour chaque dimension. Chaque dimension est évaluée et reçoit une note en fonction de sa conformité aux critères. Elle obtient ainsi une note agrégée de réussite ou d'échec.",
        "part2": "Veuillez évaluer chaque critère pour confirmer si les données s'harmonisent ou non avec les principes en sélectionnant la case à cocher à côté du critère. Un critère non sélectionné sera considéré comme non satisfait."
      },
      "table": {
        "caption": "Évaluation des dimensions de la qualité",
        "headers": {
          "elements": "Éléments",
          "definition": "Définition",
          "criteria": "Critères",
          "answer": "Réponse"
        },
        "tooltip": {
          "title": "Les points correspondent au nombre de critères satisfaits :",
          "high": "3 points = Élevé (tous les critères satisfaits)",
          "medium": "2 points = Moyen (2 critères satisfaits)",
          "low": "1 point = Faible (1 critère satisfait)",
          "notSufficient": "0 point = Insuffisant (aucun critère satisfait)"
        },
        "options": {
          "notSufficient": "0 - Insuffisant (aucun critère satisfait)",
          "low": "1 - Faible (1 critère satisfait)",
          "medium": "2 - Moyen (2 critères satisfaits)",
          "high": "3 - Élevé (tous les critères satisfaits)"
        }
      },
      "summary": {
        "title": "Résultats de l'évaluation par rapport aux dimensions de la qualité de Statistique Canada :",
        "tableCaption": "Scores détaillés des dimensions de la qualité",
        "tableHeaders": {
          "dimension": "Dimension",
          "score": "Score",
          "assessment": "Évaluation"
        },
        "totalScore": "Score total :",
        "scoreDisplay": "{{score}}/{{maxScore}}",
        "pass": "Réussite",
        "fail": "Échec"
      },
      "scoreText": {
        "notSufficient": "Insuffisant",
        "low": "Faible",
        "medium": "Moyen",
        "high": "Élevé"
      },
      "interpretation": {
        "low": "La qualité des données telle qu'évaluée ci-dessus n'est pas considérée comme apte à l'emploi pour les rapports sur les ODD. Veuillez envisager de répondre à certains des critères d'évaluation pour en améliorer la qualité, si possible.",
        "medium": "La qualité des données telle qu'évaluée ci-dessus est apte à l'emploi pour les rapports sur les ODD mais pourrait être améliorée. Veuillez envisager de répondre à certains des critères d'évaluation si possible.",
        "high": "La qualité des données telle qu'évaluée ci-dessus est apte à l'emploi pour les rapports sur les ODD.",
        "fail": "La qualité des données telle qu'évaluée ci-dessus a au moins une dimension de qualité qui n'est pas suffisante et n'est donc pas apte à l'emploi pour les rapports sur les ODD. Veuillez envisager de répondre à certains des critères d'évaluation pour en améliorer la qualité, si possible."
      },
      "actions": {
        "evaluate": "Évaluer",
        "continue": "Continuer",
        "goBack": "Retour"
      }
    },
    "overall": {
      "title": "Évaluation globale",
      "summary": {
        "title": "Résumé",
        "ethicsResults": "Partie 1 - Évaluation des principes d'éthique des données :",
        "qualityResults": "Partie 2 - Évaluation des dimensions de qualité :",
        "overallResults": "Résultat global de l'évaluation :",
        "pass": "Réussite",
        "fail": "Échec",
        "warning": "Avertissement",
        "score": "Score : {{score}}/15",
        "totalScore": "Score total sur 15"
      },
      "messages": {
        "bothPass": "Les données ont réussi les deux évaluations et sont apte à l'emploi pour les rapports sur les ODD.",
        "ethicsFailQualityPass": "Les données ne répondent pas aux principes d'éthique des données et ne sont pas considérées comme apte à l'emploi pour les rapports sur les ODD. Les données doivent respecter tous les principes d'éthique des données pour être apte à l'emploi pour les rapports sur les ODD. Veuillez réviser vos données et corriger les principes d'éthique des données qui ne sont pas respectés pour que les données soient apte à l'emploi pour les rapports sur les ODD.",
        "ethicsPassQualityFail": "Les données répondent à tous les principes d'éthique des données, mais ne répondent pas au nombre requis de critères de qualité des données. Elles ne sont pas considérées comme apte à l'emploi pour les rapports sur les ODD. Veuillez réviser vos données et corriger les critères de qualité des données qui ne sont pas respectés pour que les données soient apte à l'emploi pour les rapports sur les ODD.",
        "bothFail": "Les données ne répondent pas aux principes d'éthique des données ni aux critères des dimensions de qualité, elles ne sont donc pas apte à l'emploi pour les rapports sur les ODD. Veuillez réviser vos données et corriger les principes d'éthique des données et les critères de qualité des données qui ne sont pas respectés pour que les données soient apte à l'emploi pour les rapports sur les ODD."
      },
      "qualitySummary": {
        "title": "Résumé des dimensions de la qualité",
        "tableHeaders": {
          "dimension": "Dimension",
          "score": "Score",
          "assessment": "Évaluation"
        }
      },
      "export": {
        "title": "Exporter l'évaluation",
        "formatLabel": "Format d'exportation :",
        "formats": {
          "text": "Texte",
          "json": "JSON",
          "csv": "CSV",
          "pdf": "PDF",
          "word": "Document Word"
        },
        "buttons": {
          "export": "Exporter les résultats",
          "copy": "Copier dans le presse-papiers",
          "download": "Télécharger",
          "close": "Fermer"
        },
        "generating": "Génération en cours...",
        "dialogTitle": "Exporter les résultats d'évaluation",
        "summaryHeader": "SOMMAIRE",
        "date": "Date",
        "ethicsAssessment": "Évaluation d'éthique des données",
        "message": "Détails de l'évaluation des principes d'éthique des données",
        "qualityAssessment": "Évaluation des dimensions de la qualité",
        "interpretation": "Détails de l'évaluation des dimensions de la qualité",
        "score": "Score des dimensions de la qualité",
        "result": "Résultat global",
        "category": "Catégorie",
        "ethicsPrinciples": "PRINCIPES D'ÉTHIQUE DES DONNÉES",
        "ethicsPrinciple": "Principe d'éthique des données",
        "ethicsPrinciplesList": "Principes d'éthique des données",
        "evaluation": "Évaluation",
        "qualityDimensions": "DIMENSIONS DE LA QUALITÉ",
        "qualityDimension": "Dimension de la qualité",
        "qualityDimensionsList": "Dimensions de la qualité",
        "scoreHeader": "Score",
        "assessment": "Évaluation",
        "notEvaluated": "Non évalué",
        "criteriaStatus": {
          "satisfied": "SATISFAIT",
          "notSatisfied": "NON SATISFAIT"
        },
        "overallResult": "Résultat global",
        "overallMessage": "Détails de l'évaluation globale",
        "criteriaDetails": "Détails des critères",
        "preview": "Aperçu",
        "pdfPreview": "Un rapport PDF sera généré lorsque vous cliquez sur Télécharger.",
        "wordPreview": "Un rapport Word sera généré lorsque vous cliquez sur Télécharger."
      },
      "criteriaSatisfied": "Critères satisfaits",
      "actions": {
        "reset": "Réinitialiser l'évaluation",
        "home": "Retourner à l'accueil"
      }
    }
  },
  "ethicsPrinciples": {
    "principle1": {
      "element": "Avantages pour la population canadienne",
      "explanation": "Les renseignements obtenus et utilisés doivent fournir à la population canadienne un avantage clair et facile à communiquer. Les données doivent appuyer les rapports du Canada sur les objectifs de développement durable (ODD) en permettant la mesure d'un indicateur non présenté ou en fournissant des données permettant de produire des rapports plus détaillés à propos d'un indicateur présenté.",
      "criteria": "Les renseignements fournissent-ils un avantage clair à la population canadienne?"
    },
    "principle2": {
      "element": "Équité et absence de préjudice",
      "explanation": "Si les données diffusées portent sur des questions pouvant être de nature délicate, il est important d'avoir un plan en place pour atténuer tout risque de préjudice, d'injustice ou d'amplification des stéréotypes et de la stigmatisation à l'égard des groupes présentés dans les données. De plus, les partenaires concernés doivent être consultés tout au long du processus pour discuter de tout risque en matière d'équité et de préjudice. Les données doivent reposer sur la terminologie et les catégories appropriées permettant de décrire les différents groupes de population représenté.",
      "criteria": "Les questions pouvant être de nature délicate sont-elles traitées de façon à assurer l'équité et à ne pas causer de préjudice?"
    },
    "principle3": {
      "element": "Transparence et responsabilisation",
      "explanation": "Les méthodes employées pour transformer les renseignements afin de produire des statistiques doivent être communiquées clairement afin d'assurer la transparence. La méthodologie utilisée doit être documentée et faire l'objet d'un suivi régulier, tout comme les résultats, afin d'assurer la robustesse et la pertinence continues des rapports.",
      "criteria": "Les méthodes employées font-elles l'objet d'un suivi et d'une communication périodique, tout comme les résultats obtenus?"
    },
    "principle4": {
      "element": "Protection de la vie privée",
      "explanation": "Il est essentiel de protéger la vie privée des répondants et des répondantes tout au long du processus. Quelques exemples de méthodes qui peuvent aider comprennent de limiter l'accès aux renseignements confidentiels selon le principe du « besoin de savoir » tout en limitant la collecte aux renseignements strictement nécessaires, auprès de personnes pleinement consentantes. La vie privée des répondants et des répondantes doit être protégée à toutes les étapes du processus statistique.",
      "criteria": "La vie privée des répondants et des répondantes est-elle respectée?"
    },
    "principle5": {
      "element": "Confidentialité",
      "explanation": "Pour assurer la confidentialité, il est essentiel de s'assurer que les données ne contiennent pas de renseignements confidentiels, comme des renseignements personnels ou des caractéristiques permettant d'identifier une personne. Les données utilisées pour mesurer les progrès au Canada et en faire rapport ne doivent inclure aucun renseignement confidentiel. De plus, il ne doit pas être possible d'associer des personnes aux données diffusées.",
      "criteria": "La confidentialité est-elle maintenue?"
    }
  },
  "qualityDimensions": {
    "dimension1": {
      "element": "Exactitude et fiabilité",
      "definition": "L'exactitude des renseignements statistiques désigne la mesure dans laquelle les renseignements décrivent correctement le phénomène qu'ils sont censés mesurer. La fiabilité correspond à la mesure dans laquelle les renseignements statistiques décrivent correctement, et de façon constante au fil du temps, le phénomène qu'ils sont censés mesurer. Les données doivent mesurer, avec exactitude et fiabilité, les progrès accomplis par le Canada à l'égard d'un indicateur choisi des ODD.",
      "criteria": [
        "Il n'y a pas ou peu de valeurs manquantes pour les statistiques les plus importantes",
        "Des règles de vérification sont établies pour les données",
        "Des processus d'assurance de la qualité documentés ont été suivis"
      ]
    },
    "dimension2": {
      "element": "Actualité et ponctualité",
      "definition": "L'actualité des données statistiques désigne le délai entre la période de référence des renseignements et la date à laquelle les données sont disponibles. La ponctualité se définit comme la différence entre le moment planifié pour la disponibilité des données et leur disponibilité réelle. Les données doivent permettre de mesurer les progrès réalisés au Canada en matière d'ODD à des intervalles prévus et réguliers couvrant la période du Programme de développement durable à l'horizon 2030.",
      "criteria": [
        "Les données sont disponibles en temps opportun",
        "Les données sont diffusées à des intervalles réguliers",
        "Les données sont publiées aux dates prévues"
      ]
    },
    "dimension3": {
      "element": "Accessibilité et clarté",
      "definition": "L'accessibilité et la clarté des données et des renseignements à l'appui font référence à la facilité avec laquelle les utilisateurs et les utilisatrices savent que les renseignements existent, qu'ils sont en mesure de les trouver, de les consulter et de les utiliser. Les données et les renseignements à l'appui doivent être facilement accessibles et recueillis afin de faciliter leur utilisation dans les rapports du Canada sur les ODD.",
      "criteria": [
        "Les données et les renseignements à l'appui sont facilement accessibles",
        "Les données et les renseignements à l'appui sont fournis dans un format convivial"
      ]
    },
    "dimension4": {
      "element": "Intelligibilité",
      "definition": "L'intelligibilité des renseignements statistiques désigne la disponibilité des renseignements et des métadonnées supplémentaires qui sont nécessaires pour interpréter les données et, possiblement, les reproduire. Ces renseignements comprennent normalement les concepts sous-jacents, la période de référence des données, les variables et les classifications utilisées, ainsi que la méthodologie de collecte et de traitement des données. Les données et tout renseignement pertinent (y compris la période de référence) doivent être disponibles pour appuyer les rapports du Canada sur les ODD dans le cadre du Programme de développement durable à l'horizon 2030 (2015 à 2030).",
      "criteria": [
        "Les utilisateurs et les utilisatrices ont accès à une description des méthodes utilisées pour recueillir, traiter et analyser les données",
        "Les utilisateurs et les utilisatrices ont accès aux définitions de l'ensemble des variables, des ensembles de codes et des classifications utilisés",
        "La période de référence des données est bien définie et communiquée"
      ]
    },
    "dimension5": {
      "element": "Cohérence et comparabilité",
      "definition": "La cohérence et la comparabilité des données statistiques désignent la mesure dans laquelle ces données peuvent être combinées et comparées de manière fiable à d'autres renseignements statistiques dans un vaste cadre analytique au fil du temps. L'utilisation de normes et de concepts communs (p. ex. terminologie, classification, méthodologie, etc.) est essentielle pour assurer la cohérence des données et de tout renseignement pertinent et pour en faciliter l'utilisation dans les rapports du Canada sur les ODD.",
      "criteria": [
        "Des concepts normalisés sont utilisés",
        "La comparabilité est maintenue au fil du temps et d'une région à l'autre",
        "Toute incohérence ou rupture dans la série chronologique est expliquée"
      ]
    }
  },
  "alerts": {
    "title": "Alerte",
    "ok": "OK"
  }
} 
